# 6. Реализовать алгоритм перемешивания списка.

st = set()

for i in range(101):
    st.add(str(i))
print(st)
for i in st:
    print(int())
    break