# 2. Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.
#     1, 2, 8, 7, 5
#     78, 55, 36, 90, 2

# list = [1, 2 ,8, 7, 5]
list_a = [78, 55, 36, 90, 2]
maxNum = list_a[0]
for i in list_a:
    if i > maxNum:
        maxNum = i
print(maxNum)
# -----------------------------------------------
print(max(list_a))