# 3. Напишите программу, которая определит позицию второго вхождения
#    строки в списке либо сообщит, что её нет.
#    Пример:
#    list = ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
#    list = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
#    list = ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
#    list = ["123", "234", 123, "567"], ищем: "123", ответ: -1
#    list = [], ищем: "123", ответ: -1

# list1 = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
# x = "йцу"
# count = 0
# b = None
# for i in range(len(list1)):
#     if list1[i] == x:
#         count += 1
#         if count == 2:
#             b = i
#     else:
#         b = '-1'
# print(b + 1)
# ---------------------------------------------
def search(arr, str1):
    count = 0
    for i in range(len(arr)):
        if arr[i] == str1:
            count += 1
        if count == 2:
            return i + 1
    return -1

list1 = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
print(search(list1, "йцу"))
