# 3.3. Задайте список из вещественных чисел. Напишите программу, которая
#      найдёт разницу между максимальным и минимальным значением дробной части элементов.
#      Пример:
#      - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

list1 = [1.1, 1.2, 3.1, 5, 10.01]
list2 = []

for i in list1:
    list2.append(round(i - int(i), 2))

max1 = list2[0]
min1 = list1[0]
for i in list2:
    if i > max1:
        max1 = i
    if i < min1 and i != 0:
        min1 = i
print(max1 - min1)